InformationRegisters/ПорядокОкругленияРезультатовРасчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПорядокОкругленияРезультатовРасчетаЗарплаты</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодОкругления</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыОкругления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.УдержанияОрганизаций</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисленияОрганизаций</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.УправленческиеУдержания</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.УправленческиеНачисления</v8:Type>
						<v8:Type>cfg:CatalogRef.НалогиСборыОтчисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПорядкиОкругления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПорядкиОкругления</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Окр0_01</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_05</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_1</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_5</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр5</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр10</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр50</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр100</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ПорядокОкругленияРезультатовРасчетаЗарплаты/Ext/RecordSetModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаОкругления Из ЭтотОбъект Цикл
		
		Если СтрокаОкругления.ВидРасчета = Справочники.НалогиСборыОтчисления.ВзносыОбязательноеСоциальноеМедицинскоеСтрахование
			И СтрокаОкругления.Период >= Дата(2020, 1, 1) Тогда
			
			СообщениеОбОшибке = НСтр("ru = 'Данные о порядке округления ""Взносы на обязательное социальное медицинское страхование"" вводятся до 2020 года. С 2020 года округление производится автоматически, согласно действующим нормам законодательства.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
			Отказ = Истина;
            
        ИначеЕсли СтрокаОкругления.ВидРасчета = Справочники.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование
            И СтрокаОкругления.Период >= Дата(2022, 1, 1) Тогда
            
  			Сообщить("Данные о порядке округления ""Отчисления на обязательное социальное медицинское страхование"" вводятся до 2022 года. С 2022 года округление производится автоматически, согласно действующим нормам законодательства.", СтатусСообщения.Важное);
            Отказ = Истина;

        ИначеЕсли СтрокаОкругления.ВидРасчета = Справочники.НалогиСборыОтчисления.ОбязательныеСоциальныеОтчисления
            И СтрокаОкругления.Период >= Дата(2022, 1, 1) Тогда
            
			Если СтрокаОкругления.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр0_5
				ИЛИ СтрокаОкругления.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр0_5 
				ИЛИ СтрокаОкругления.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр0_05 
				ИЛИ СтрокаОкругления.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр0_1
				ИЛИ СтрокаОкругления.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр0_01 Тогда
				
				Сообщить("Порядок округления ""Социальных отчислений"" регламентирован, необходимо выбрать округление до целого.", СтатусСообщения.Важное);
	            Отказ = Истина;
				
			КонецЕсли;

		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
